Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/hefc.h
/**
 * \brief Component description for HEFC
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-01-08T10:06:16Z */
#ifndef _SAMRH71_HEFC_COMPONENT_H_
#define _SAMRH71_HEFC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR HEFC                                         */
/* ************************************************************************** */

/* -------- HEFC_FMR : (HEFC Offset: 0x00) (R/W 32) HEFC Flash Mode Register -------- */
#define HEFC_FMR_FRDY_Pos                     _U_(0)                                               /**< (HEFC_FMR) Flash Ready Interrupt Enable Position */
#define HEFC_FMR_FRDY_Msk                     (_U_(0x1) << HEFC_FMR_FRDY_Pos)                      /**< (HEFC_FMR) Flash Ready Interrupt Enable Mask */
#define HEFC_FMR_FRDY(value)                  (HEFC_FMR_FRDY_Msk & ((value) << HEFC_FMR_FRDY_Pos))
#define HEFC_FMR_FPSI_Pos                     _U_(1)                                               /**< (HEFC_FMR) Flash Power Status Interrupt Enable Position */
#define HEFC_FMR_FPSI_Msk                     (_U_(0x1) << HEFC_FMR_FPSI_Pos)                      /**< (HEFC_FMR) Flash Power Status Interrupt Enable Mask */
#define HEFC_FMR_FPSI(value)                  (HEFC_FMR_FPSI_Msk & ((value) << HEFC_FMR_FPSI_Pos))
#define HEFC_FMR_ONE_Pos                      _U_(16)                                              /**< (HEFC_FMR) Must be written to 1 Position */
#define HEFC_FMR_ONE_Msk                      (_U_(0x1) << HEFC_FMR_ONE_Pos)                       /**< (HEFC_FMR) Must be written to 1 Mask */
#define HEFC_FMR_ONE(value)                   (HEFC_FMR_ONE_Msk & ((value) << HEFC_FMR_ONE_Pos))  
#define HEFC_FMR_Msk                          _U_(0x00010003)                                      /**< (HEFC_FMR) Register Mask  */


/* -------- HEFC_FCR : (HEFC Offset: 0x04) ( /W 32) HEFC Flash Command Register -------- */
#define HEFC_FCR_FCMD_Pos                     _U_(0)                                               /**< (HEFC_FCR) Flash Command Position */
#define HEFC_FCR_FCMD_Msk                     (_U_(0xFF) << HEFC_FCR_FCMD_Pos)                     /**< (HEFC_FCR) Flash Command Mask */
#define HEFC_FCR_FCMD(value)                  (HEFC_FCR_FCMD_Msk & ((value) << HEFC_FCR_FCMD_Pos))
#define   HEFC_FCR_FCMD_GETD_Val              _U_(0x0)                                             /**< (HEFC_FCR) Get Flash descriptor  */
#define   HEFC_FCR_FCMD_WP_Val                _U_(0x1)                                             /**< (HEFC_FCR) Write page  */
#define   HEFC_FCR_FCMD_WPL_Val               _U_(0x2)                                             /**< (HEFC_FCR) Write page and lock  */
#define   HEFC_FCR_FCMD_EA_Val                _U_(0x5)                                             /**< (HEFC_FCR) Erase all  */
#define   HEFC_FCR_FCMD_EP_Val                _U_(0x6)                                             /**< (HEFC_FCR) Erase page  */
#define   HEFC_FCR_FCMD_EPA_Val               _U_(0x7)                                             /**< (HEFC_FCR) Erase pages  */
#define   HEFC_FCR_FCMD_SLB_Val               _U_(0x8)                                             /**< (HEFC_FCR) Set lock bit  */
#define   HEFC_FCR_FCMD_CLB_Val               _U_(0x9)                                             /**< (HEFC_FCR) Clear lock bit  */
#define   HEFC_FCR_FCMD_GLB_Val               _U_(0xA)                                             /**< (HEFC_FCR) Get lock bit  */
#define   HEFC_FCR_FCMD_SGPB_Val              _U_(0xB)                                             /**< (HEFC_FCR) Set GPNVM bit  */
#define   HEFC_FCR_FCMD_CGPB_Val              _U_(0xC)                                             /**< (HEFC_FCR) Clear GPNVM bit  */
#define   HEFC_FCR_FCMD_GGPB_Val              _U_(0xD)                                             /**< (HEFC_FCR) Get GPNVM bit  */
#define   HEFC_FCR_FCMD_GCALB_Val             _U_(0x10)                                            /**< (HEFC_FCR) Get CALIB bit  */
#define   HEFC_FCR_FCMD_WUS_Val               _U_(0x12)                                            /**< (HEFC_FCR) Write user signature  */
#define   HEFC_FCR_FCMD_EUS_Val               _U_(0x13)                                            /**< (HEFC_FCR) Erase user signature  */
#define   HEFC_FCR_FCMD_STUS_Val              _U_(0x14)                                            /**< (HEFC_FCR) Start read user signature  */
#define   HEFC_FCR_FCMD_SPUS_Val              _U_(0x15)                                            /**< (HEFC_FCR) Stop read user signature  */
#define HEFC_FCR_FCMD_GETD                    (HEFC_FCR_FCMD_GETD_Val << HEFC_FCR_FCMD_Pos)        /**< (HEFC_FCR) Get Flash descriptor Position  */
#define HEFC_FCR_FCMD_WP                      (HEFC_FCR_FCMD_WP_Val << HEFC_FCR_FCMD_Pos)          /**< (HEFC_FCR) Write page Position  */
#define HEFC_FCR_FCMD_WPL                     (HEFC_FCR_FCMD_WPL_Val << HEFC_FCR_FCMD_Pos)         /**< (HEFC_FCR) Write page and lock Position  */
#define HEFC_FCR_FCMD_EA                      (HEFC_FCR_FCMD_EA_Val << HEFC_FCR_FCMD_Pos)          /**< (HEFC_FCR) Erase all Position  */
#define HEFC_FCR_FCMD_EP                      (HEFC_FCR_FCMD_EP_Val << HEFC_FCR_FCMD_Pos)          /**< (HEFC_FCR) Erase page Position  */
#define HEFC_FCR_FCMD_EPA                     (HEFC_FCR_FCMD_EPA_Val << HEFC_FCR_FCMD_Pos)         /**< (HEFC_FCR) Erase pages Position  */
#define HEFC_FCR_FCMD_SLB                     (HEFC_FCR_FCMD_SLB_Val << HEFC_FCR_FCMD_Pos)         /**< (HEFC_FCR) Set lock bit Position  */
#define HEFC_FCR_FCMD_CLB                     (HEFC_FCR_FCMD_CLB_Val << HEFC_FCR_FCMD_Pos)         /**< (HEFC_FCR) Clear lock bit Position  */
#define HEFC_FCR_FCMD_GLB                     (HEFC_FCR_FCMD_GLB_Val << HEFC_FCR_FCMD_Pos)         /**< (HEFC_FCR) Get lock bit Position  */
#define HEFC_FCR_FCMD_SGPB                    (HEFC_FCR_FCMD_SGPB_Val << HEFC_FCR_FCMD_Pos)        /**< (HEFC_FCR) Set GPNVM bit Position  */
#define HEFC_FCR_FCMD_CGPB                    (HEFC_FCR_FCMD_CGPB_Val << HEFC_FCR_FCMD_Pos)        /**< (HEFC_FCR) Clear GPNVM bit Position  */
#define HEFC_FCR_FCMD_GGPB                    (HEFC_FCR_FCMD_GGPB_Val << HEFC_FCR_FCMD_Pos)        /**< (HEFC_FCR) Get GPNVM bit Position  */
#define HEFC_FCR_FCMD_GCALB                   (HEFC_FCR_FCMD_GCALB_Val << HEFC_FCR_FCMD_Pos)       /**< (HEFC_FCR) Get CALIB bit Position  */
#define HEFC_FCR_FCMD_WUS                     (HEFC_FCR_FCMD_WUS_Val << HEFC_FCR_FCMD_Pos)         /**< (HEFC_FCR) Write user signature Position  */
#define HEFC_FCR_FCMD_EUS                     (HEFC_FCR_FCMD_EUS_Val << HEFC_FCR_FCMD_Pos)         /**< (HEFC_FCR) Erase user signature Position  */
#define HEFC_FCR_FCMD_STUS                    (HEFC_FCR_FCMD_STUS_Val << HEFC_FCR_FCMD_Pos)        /**< (HEFC_FCR) Start read user signature Position  */
#define HEFC_FCR_FCMD_SPUS                    (HEFC_FCR_FCMD_SPUS_Val << HEFC_FCR_FCMD_Pos)        /**< (HEFC_FCR) Stop read user signature Position  */
#define HEFC_FCR_FARG_Pos                     _U_(8)                                               /**< (HEFC_FCR) Flash Command Argument Position */
#define HEFC_FCR_FARG_Msk                     (_U_(0xFFFF) << HEFC_FCR_FARG_Pos)                   /**< (HEFC_FCR) Flash Command Argument Mask */
#define HEFC_FCR_FARG(value)                  (HEFC_FCR_FARG_Msk & ((value) << HEFC_FCR_FARG_Pos))
#define HEFC_FCR_FKEY_Pos                     _U_(24)                                              /**< (HEFC_FCR) Flash Writing Protection Key Position */
#define HEFC_FCR_FKEY_Msk                     (_U_(0xFF) << HEFC_FCR_FKEY_Pos)                     /**< (HEFC_FCR) Flash Writing Protection Key Mask */
#define HEFC_FCR_FKEY(value)                  (HEFC_FCR_FKEY_Msk & ((value) << HEFC_FCR_FKEY_Pos))
#define   HEFC_FCR_FKEY_PASSWD_Val            _U_(0x5A)                                            /**< (HEFC_FCR) The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started.  */
#define HEFC_FCR_FKEY_PASSWD                  (HEFC_FCR_FKEY_PASSWD_Val << HEFC_FCR_FKEY_Pos)      /**< (HEFC_FCR) The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started. Position  */
#define HEFC_FCR_Msk                          _U_(0xFFFFFFFF)                                      /**< (HEFC_FCR) Register Mask  */


