Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/hefc.h
/* -------- HEFC_FSR : (HEFC Offset: 0x08) ( R/ 32) HEFC Flash Status Register -------- */
#define HEFC_FSR_FRDY_Pos                     _U_(0)                                               /**< (HEFC_FSR) Flash Ready Status (cleared when Flash is busy) Position */
#define HEFC_FSR_FRDY_Msk                     (_U_(0x1) << HEFC_FSR_FRDY_Pos)                      /**< (HEFC_FSR) Flash Ready Status (cleared when Flash is busy) Mask */
#define HEFC_FSR_FRDY(value)                  (HEFC_FSR_FRDY_Msk & ((value) << HEFC_FSR_FRDY_Pos))
#define HEFC_FSR_FCMDE_Pos                    _U_(1)                                               /**< (HEFC_FSR) Flash Command Error Status (cleared on read or by writing HEFC_FCR) Position */
#define HEFC_FSR_FCMDE_Msk                    (_U_(0x1) << HEFC_FSR_FCMDE_Pos)                     /**< (HEFC_FSR) Flash Command Error Status (cleared on read or by writing HEFC_FCR) Mask */
#define HEFC_FSR_FCMDE(value)                 (HEFC_FSR_FCMDE_Msk & ((value) << HEFC_FSR_FCMDE_Pos))
#define HEFC_FSR_FLOCKE_Pos                   _U_(2)                                               /**< (HEFC_FSR) Flash Lock Error Status (cleared on read) Position */
#define HEFC_FSR_FLOCKE_Msk                   (_U_(0x1) << HEFC_FSR_FLOCKE_Pos)                    /**< (HEFC_FSR) Flash Lock Error Status (cleared on read) Mask */
#define HEFC_FSR_FLOCKE(value)                (HEFC_FSR_FLOCKE_Msk & ((value) << HEFC_FSR_FLOCKE_Pos))
#define HEFC_FSR_WREER_Pos                    _U_(4)                                               /**< (HEFC_FSR) Write Register Error Status (cleared on read) Position */
#define HEFC_FSR_WREER_Msk                    (_U_(0x1) << HEFC_FSR_WREER_Pos)                     /**< (HEFC_FSR) Write Register Error Status (cleared on read) Mask */
#define HEFC_FSR_WREER(value)                 (HEFC_FSR_WREER_Msk & ((value) << HEFC_FSR_WREER_Pos))
#define HEFC_FSR_Msk                          _U_(0x00000017)                                      /**< (HEFC_FSR) Register Mask  */


/* -------- HEFC_FRR : (HEFC Offset: 0x0C) ( R/ 32) HEFC Flash Result Register -------- */
#define HEFC_FRR_FVALUE_Pos                   _U_(0)                                               /**< (HEFC_FRR) Flash Result Value Position */
#define HEFC_FRR_FVALUE_Msk                   (_U_(0xFFFFFFFF) << HEFC_FRR_FVALUE_Pos)             /**< (HEFC_FRR) Flash Result Value Mask */
#define HEFC_FRR_FVALUE(value)                (HEFC_FRR_FVALUE_Msk & ((value) << HEFC_FRR_FVALUE_Pos))
#define HEFC_FRR_Msk                          _U_(0xFFFFFFFF)                                      /**< (HEFC_FRR) Register Mask  */


/* -------- HEFC_FPMR : (HEFC Offset: 0x40) (R/W 32) HEFC Flash Power Management Register -------- */
#define HEFC_FPMR_PWS_EN_Pos                  _U_(0)                                               /**< (HEFC_FPMR) Power switch enable Position */
#define HEFC_FPMR_PWS_EN_Msk                  (_U_(0x1) << HEFC_FPMR_PWS_EN_Pos)                   /**< (HEFC_FPMR) Power switch enable Mask */
#define HEFC_FPMR_PWS_EN(value)               (HEFC_FPMR_PWS_EN_Msk & ((value) << HEFC_FPMR_PWS_EN_Pos))
#define HEFC_FPMR_PWS_STAT_Pos                _U_(1)                                               /**< (HEFC_FPMR) Power switch Status Position */
#define HEFC_FPMR_PWS_STAT_Msk                (_U_(0x1) << HEFC_FPMR_PWS_STAT_Pos)                 /**< (HEFC_FPMR) Power switch Status Mask */
#define HEFC_FPMR_PWS_STAT(value)             (HEFC_FPMR_PWS_STAT_Msk & ((value) << HEFC_FPMR_PWS_STAT_Pos))
#define HEFC_FPMR_PWS_DLY_Pos                 _U_(2)                                               /**< (HEFC_FPMR) Power switch Delay Position */
#define HEFC_FPMR_PWS_DLY_Msk                 (_U_(0x3) << HEFC_FPMR_PWS_DLY_Pos)                  /**< (HEFC_FPMR) Power switch Delay Mask */
#define HEFC_FPMR_PWS_DLY(value)              (HEFC_FPMR_PWS_DLY_Msk & ((value) << HEFC_FPMR_PWS_DLY_Pos))
#define   HEFC_FPMR_PWS_DLY_75US_Val          _U_(0x0)                                             /**< (HEFC_FPMR) delay is set to 75 usec  */
#define   HEFC_FPMR_PWS_DLY_150US_Val         _U_(0x1)                                             /**< (HEFC_FPMR) delay is set to 150 usec  */
#define   HEFC_FPMR_PWS_DLY_300US_Val         _U_(0x2)                                             /**< (HEFC_FPMR) delay is set to 300 usec  */
#define   HEFC_FPMR_PWS_DLY_600US_Val         _U_(0x3)                                             /**< (HEFC_FPMR) delay is set to 600 usec  */
#define HEFC_FPMR_PWS_DLY_75US                (HEFC_FPMR_PWS_DLY_75US_Val << HEFC_FPMR_PWS_DLY_Pos) /**< (HEFC_FPMR) delay is set to 75 usec Position  */
#define HEFC_FPMR_PWS_DLY_150US               (HEFC_FPMR_PWS_DLY_150US_Val << HEFC_FPMR_PWS_DLY_Pos) /**< (HEFC_FPMR) delay is set to 150 usec Position  */
#define HEFC_FPMR_PWS_DLY_300US               (HEFC_FPMR_PWS_DLY_300US_Val << HEFC_FPMR_PWS_DLY_Pos) /**< (HEFC_FPMR) delay is set to 300 usec Position  */
#define HEFC_FPMR_PWS_DLY_600US               (HEFC_FPMR_PWS_DLY_600US_Val << HEFC_FPMR_PWS_DLY_Pos) /**< (HEFC_FPMR) delay is set to 600 usec Position  */
#define HEFC_FPMR_VAR_FACTOR_Pos              _U_(8)                                               /**< (HEFC_FPMR) Variation Factor Position */
#define HEFC_FPMR_VAR_FACTOR_Msk              (_U_(0x3F) << HEFC_FPMR_VAR_FACTOR_Pos)              /**< (HEFC_FPMR) Variation Factor Mask */
#define HEFC_FPMR_VAR_FACTOR(value)           (HEFC_FPMR_VAR_FACTOR_Msk & ((value) << HEFC_FPMR_VAR_FACTOR_Pos))
#define HEFC_FPMR_FUNC_ISOL_CTRL_N_Pos        _U_(16)                                              /**< (HEFC_FPMR) Flash insulated Control Status Position */
#define HEFC_FPMR_FUNC_ISOL_CTRL_N_Msk        (_U_(0x1) << HEFC_FPMR_FUNC_ISOL_CTRL_N_Pos)         /**< (HEFC_FPMR) Flash insulated Control Status Mask */
#define HEFC_FPMR_FUNC_ISOL_CTRL_N(value)     (HEFC_FPMR_FUNC_ISOL_CTRL_N_Msk & ((value) << HEFC_FPMR_FUNC_ISOL_CTRL_N_Pos))
#define HEFC_FPMR_Msk                         _U_(0x00013F0F)                                      /**< (HEFC_FPMR) Register Mask  */


/* -------- HEFC_WPMR : (HEFC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define HEFC_WPMR_WPEN_Pos                    _U_(0)                                               /**< (HEFC_WPMR) Write Protection Enable Position */
#define HEFC_WPMR_WPEN_Msk                    (_U_(0x1) << HEFC_WPMR_WPEN_Pos)                     /**< (HEFC_WPMR) Write Protection Enable Mask */
#define HEFC_WPMR_WPEN(value)                 (HEFC_WPMR_WPEN_Msk & ((value) << HEFC_WPMR_WPEN_Pos))
#define HEFC_WPMR_GPNVMWP_Pos                 _U_(1)                                               /**< (HEFC_WPMR) GPNVM Bit Write Protection Position */
#define HEFC_WPMR_GPNVMWP_Msk                 (_U_(0x1) << HEFC_WPMR_GPNVMWP_Pos)                  /**< (HEFC_WPMR) GPNVM Bit Write Protection Mask */
#define HEFC_WPMR_GPNVMWP(value)              (HEFC_WPMR_GPNVMWP_Msk & ((value) << HEFC_WPMR_GPNVMWP_Pos))
#define HEFC_WPMR_LOCKWP_Pos                  _U_(2)                                               /**< (HEFC_WPMR) Lock Bit Write Protection Position */
#define HEFC_WPMR_LOCKWP_Msk                  (_U_(0x1) << HEFC_WPMR_LOCKWP_Pos)                   /**< (HEFC_WPMR) Lock Bit Write Protection Mask */
#define HEFC_WPMR_LOCKWP(value)               (HEFC_WPMR_LOCKWP_Msk & ((value) << HEFC_WPMR_LOCKWP_Pos))
#define HEFC_WPMR_ERASEWP_Pos                 _U_(3)                                               /**< (HEFC_WPMR) Page, Sector and Plane Write Protection Position */
#define HEFC_WPMR_ERASEWP_Msk                 (_U_(0x1) << HEFC_WPMR_ERASEWP_Pos)                  /**< (HEFC_WPMR) Page, Sector and Plane Write Protection Mask */
#define HEFC_WPMR_ERASEWP(value)              (HEFC_WPMR_ERASEWP_Msk & ((value) << HEFC_WPMR_ERASEWP_Pos))
#define HEFC_WPMR_USER_Pos                    _U_(4)                                               /**< (HEFC_WPMR) User Signature Write Protection Position */
#define HEFC_WPMR_USER_Msk                    (_U_(0x1) << HEFC_WPMR_USER_Pos)                     /**< (HEFC_WPMR) User Signature Write Protection Mask */
#define HEFC_WPMR_USER(value)                 (HEFC_WPMR_USER_Msk & ((value) << HEFC_WPMR_USER_Pos))
#define HEFC_WPMR_WPKEY_Pos                   _U_(8)                                               /**< (HEFC_WPMR) Write Protection Key Position */
#define HEFC_WPMR_WPKEY_Msk                   (_U_(0xFFFFFF) << HEFC_WPMR_WPKEY_Pos)               /**< (HEFC_WPMR) Write Protection Key Mask */
#define HEFC_WPMR_WPKEY(value)                (HEFC_WPMR_WPKEY_Msk & ((value) << HEFC_WPMR_WPKEY_Pos))
#define   HEFC_WPMR_WPKEY_PASSWD_Val          _U_(0x454643)                                        /**< (HEFC_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define HEFC_WPMR_WPKEY_PASSWD                (HEFC_WPMR_WPKEY_PASSWD_Val << HEFC_WPMR_WPKEY_Pos)  /**< (HEFC_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define HEFC_WPMR_Msk                         _U_(0xFFFFFF1F)                                      /**< (HEFC_WPMR) Register Mask  */


/* -------- HEFC_HECC_CR0 : (HEFC Offset: 0x100) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 0 -------- */
#define HEFC_HECC_CR0_ENABLE_Pos              _U_(0)                                               /**< (HEFC_HECC_CR0) ECC protection enable Position */
#define HEFC_HECC_CR0_ENABLE_Msk              (_U_(0x1) << HEFC_HECC_CR0_ENABLE_Pos)               /**< (HEFC_HECC_CR0) ECC protection enable Mask */
#define HEFC_HECC_CR0_ENABLE(value)           (HEFC_HECC_CR0_ENABLE_Msk & ((value) << HEFC_HECC_CR0_ENABLE_Pos))
#define HEFC_HECC_CR0_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEFC_HECC_CR0) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR0_TEST_MODE_RD_Msk        (_U_(0x1) << HEFC_HECC_CR0_TEST_MODE_RD_Pos)         /**< (HEFC_HECC_CR0) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR0_TEST_MODE_RD(value)     (HEFC_HECC_CR0_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR0_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR0_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEFC_HECC_CR0) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR0_TEST_MODE_WR_Msk        (_U_(0x1) << HEFC_HECC_CR0_TEST_MODE_WR_Pos)         /**< (HEFC_HECC_CR0) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR0_TEST_MODE_WR(value)     (HEFC_HECC_CR0_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR0_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR0_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEFC_HECC_CR0) reset the fixable error counter Position */
#define HEFC_HECC_CR0_RST_FIX_CPT_Msk         (_U_(0x1) << HEFC_HECC_CR0_RST_FIX_CPT_Pos)          /**< (HEFC_HECC_CR0) reset the fixable error counter Mask */
#define HEFC_HECC_CR0_RST_FIX_CPT(value)      (HEFC_HECC_CR0_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR0_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR0_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEFC_HECC_CR0) reset the un-fixable error counter Position */
#define HEFC_HECC_CR0_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEFC_HECC_CR0_RST_NOFIX_CPT_Pos)        /**< (HEFC_HECC_CR0) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR0_RST_NOFIX_CPT(value)    (HEFC_HECC_CR0_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR0_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR0_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEFC_HECC_CR0) BCH ECC enable Position */
#define HEFC_HECC_CR0_ECC12_ENABLE_Msk        (_U_(0x1) << HEFC_HECC_CR0_ECC12_ENABLE_Pos)         /**< (HEFC_HECC_CR0) BCH ECC enable Mask */
#define HEFC_HECC_CR0_ECC12_ENABLE(value)     (HEFC_HECC_CR0_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR0_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR0_Msk                     _U_(0x00000077)                                      /**< (HEFC_HECC_CR0) Register Mask  */


/* -------- HEFC_HECC_CR1 : (HEFC Offset: 0x104) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 1 -------- */
#define HEFC_HECC_CR1_ENABLE_Pos              _U_(0)                                               /**< (HEFC_HECC_CR1) ECC protection enable Position */
#define HEFC_HECC_CR1_ENABLE_Msk              (_U_(0x1) << HEFC_HECC_CR1_ENABLE_Pos)               /**< (HEFC_HECC_CR1) ECC protection enable Mask */
#define HEFC_HECC_CR1_ENABLE(value)           (HEFC_HECC_CR1_ENABLE_Msk & ((value) << HEFC_HECC_CR1_ENABLE_Pos))
#define HEFC_HECC_CR1_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEFC_HECC_CR1) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR1_TEST_MODE_RD_Msk        (_U_(0x1) << HEFC_HECC_CR1_TEST_MODE_RD_Pos)         /**< (HEFC_HECC_CR1) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR1_TEST_MODE_RD(value)     (HEFC_HECC_CR1_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR1_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR1_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEFC_HECC_CR1) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR1_TEST_MODE_WR_Msk        (_U_(0x1) << HEFC_HECC_CR1_TEST_MODE_WR_Pos)         /**< (HEFC_HECC_CR1) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR1_TEST_MODE_WR(value)     (HEFC_HECC_CR1_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR1_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR1_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEFC_HECC_CR1) reset the fixable error counter Position */
#define HEFC_HECC_CR1_RST_FIX_CPT_Msk         (_U_(0x1) << HEFC_HECC_CR1_RST_FIX_CPT_Pos)          /**< (HEFC_HECC_CR1) reset the fixable error counter Mask */
#define HEFC_HECC_CR1_RST_FIX_CPT(value)      (HEFC_HECC_CR1_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR1_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR1_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEFC_HECC_CR1) reset the un-fixable error counter Position */
#define HEFC_HECC_CR1_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEFC_HECC_CR1_RST_NOFIX_CPT_Pos)        /**< (HEFC_HECC_CR1) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR1_RST_NOFIX_CPT(value)    (HEFC_HECC_CR1_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR1_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR1_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEFC_HECC_CR1) BCH ECC enable Position */
#define HEFC_HECC_CR1_ECC12_ENABLE_Msk        (_U_(0x1) << HEFC_HECC_CR1_ECC12_ENABLE_Pos)         /**< (HEFC_HECC_CR1) BCH ECC enable Mask */
#define HEFC_HECC_CR1_ECC12_ENABLE(value)     (HEFC_HECC_CR1_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR1_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR1_Msk                     _U_(0x00000077)                                      /**< (HEFC_HECC_CR1) Register Mask  */


/* -------- HEFC_HECC_CR2 : (HEFC Offset: 0x108) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 2 -------- */
#define HEFC_HECC_CR2_ENABLE_Pos              _U_(0)                                               /**< (HEFC_HECC_CR2) ECC protection enable Position */
#define HEFC_HECC_CR2_ENABLE_Msk              (_U_(0x1) << HEFC_HECC_CR2_ENABLE_Pos)               /**< (HEFC_HECC_CR2) ECC protection enable Mask */
#define HEFC_HECC_CR2_ENABLE(value)           (HEFC_HECC_CR2_ENABLE_Msk & ((value) << HEFC_HECC_CR2_ENABLE_Pos))
#define HEFC_HECC_CR2_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEFC_HECC_CR2) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR2_TEST_MODE_RD_Msk        (_U_(0x1) << HEFC_HECC_CR2_TEST_MODE_RD_Pos)         /**< (HEFC_HECC_CR2) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR2_TEST_MODE_RD(value)     (HEFC_HECC_CR2_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR2_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR2_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEFC_HECC_CR2) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR2_TEST_MODE_WR_Msk        (_U_(0x1) << HEFC_HECC_CR2_TEST_MODE_WR_Pos)         /**< (HEFC_HECC_CR2) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR2_TEST_MODE_WR(value)     (HEFC_HECC_CR2_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR2_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR2_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEFC_HECC_CR2) reset the fixable error counter Position */
#define HEFC_HECC_CR2_RST_FIX_CPT_Msk         (_U_(0x1) << HEFC_HECC_CR2_RST_FIX_CPT_Pos)          /**< (HEFC_HECC_CR2) reset the fixable error counter Mask */
#define HEFC_HECC_CR2_RST_FIX_CPT(value)      (HEFC_HECC_CR2_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR2_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR2_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEFC_HECC_CR2) reset the un-fixable error counter Position */
#define HEFC_HECC_CR2_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEFC_HECC_CR2_RST_NOFIX_CPT_Pos)        /**< (HEFC_HECC_CR2) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR2_RST_NOFIX_CPT(value)    (HEFC_HECC_CR2_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR2_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR2_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEFC_HECC_CR2) BCH ECC enable Position */
#define HEFC_HECC_CR2_ECC12_ENABLE_Msk        (_U_(0x1) << HEFC_HECC_CR2_ECC12_ENABLE_Pos)         /**< (HEFC_HECC_CR2) BCH ECC enable Mask */
#define HEFC_HECC_CR2_ECC12_ENABLE(value)     (HEFC_HECC_CR2_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR2_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR2_Msk                     _U_(0x00000077)                                      /**< (HEFC_HECC_CR2) Register Mask  */


/* -------- HEFC_HECC_CR3 : (HEFC Offset: 0x10C) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 3 -------- */
#define HEFC_HECC_CR3_ENABLE_Pos              _U_(0)                                               /**< (HEFC_HECC_CR3) ECC protection enable Position */
#define HEFC_HECC_CR3_ENABLE_Msk              (_U_(0x1) << HEFC_HECC_CR3_ENABLE_Pos)               /**< (HEFC_HECC_CR3) ECC protection enable Mask */
#define HEFC_HECC_CR3_ENABLE(value)           (HEFC_HECC_CR3_ENABLE_Msk & ((value) << HEFC_HECC_CR3_ENABLE_Pos))
#define HEFC_HECC_CR3_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEFC_HECC_CR3) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR3_TEST_MODE_RD_Msk        (_U_(0x1) << HEFC_HECC_CR3_TEST_MODE_RD_Pos)         /**< (HEFC_HECC_CR3) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR3_TEST_MODE_RD(value)     (HEFC_HECC_CR3_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR3_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR3_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEFC_HECC_CR3) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR3_TEST_MODE_WR_Msk        (_U_(0x1) << HEFC_HECC_CR3_TEST_MODE_WR_Pos)         /**< (HEFC_HECC_CR3) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR3_TEST_MODE_WR(value)     (HEFC_HECC_CR3_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR3_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR3_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEFC_HECC_CR3) reset the fixable error counter Position */
#define HEFC_HECC_CR3_RST_FIX_CPT_Msk         (_U_(0x1) << HEFC_HECC_CR3_RST_FIX_CPT_Pos)          /**< (HEFC_HECC_CR3) reset the fixable error counter Mask */
#define HEFC_HECC_CR3_RST_FIX_CPT(value)      (HEFC_HECC_CR3_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR3_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR3_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEFC_HECC_CR3) reset the un-fixable error counter Position */
#define HEFC_HECC_CR3_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEFC_HECC_CR3_RST_NOFIX_CPT_Pos)        /**< (HEFC_HECC_CR3) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR3_RST_NOFIX_CPT(value)    (HEFC_HECC_CR3_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR3_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR3_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEFC_HECC_CR3) BCH ECC enable Position */
#define HEFC_HECC_CR3_ECC12_ENABLE_Msk        (_U_(0x1) << HEFC_HECC_CR3_ECC12_ENABLE_Pos)         /**< (HEFC_HECC_CR3) BCH ECC enable Mask */
#define HEFC_HECC_CR3_ECC12_ENABLE(value)     (HEFC_HECC_CR3_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR3_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR3_Msk                     _U_(0x00000077)                                      /**< (HEFC_HECC_CR3) Register Mask  */


/* -------- HEFC_HECC_CR4 : (HEFC Offset: 0x110) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 4 -------- */
#define HEFC_HECC_CR4_ENABLE_Pos              _U_(0)                                               /**< (HEFC_HECC_CR4) ECC protection enable Position */
#define HEFC_HECC_CR4_ENABLE_Msk              (_U_(0x1) << HEFC_HECC_CR4_ENABLE_Pos)               /**< (HEFC_HECC_CR4) ECC protection enable Mask */
#define HEFC_HECC_CR4_ENABLE(value)           (HEFC_HECC_CR4_ENABLE_Msk & ((value) << HEFC_HECC_CR4_ENABLE_Pos))
#define HEFC_HECC_CR4_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEFC_HECC_CR4) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR4_TEST_MODE_RD_Msk        (_U_(0x1) << HEFC_HECC_CR4_TEST_MODE_RD_Pos)         /**< (HEFC_HECC_CR4) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR4_TEST_MODE_RD(value)     (HEFC_HECC_CR4_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR4_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR4_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEFC_HECC_CR4) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR4_TEST_MODE_WR_Msk        (_U_(0x1) << HEFC_HECC_CR4_TEST_MODE_WR_Pos)         /**< (HEFC_HECC_CR4) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR4_TEST_MODE_WR(value)     (HEFC_HECC_CR4_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR4_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR4_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEFC_HECC_CR4) reset the fixable error counter Position */
#define HEFC_HECC_CR4_RST_FIX_CPT_Msk         (_U_(0x1) << HEFC_HECC_CR4_RST_FIX_CPT_Pos)          /**< (HEFC_HECC_CR4) reset the fixable error counter Mask */
#define HEFC_HECC_CR4_RST_FIX_CPT(value)      (HEFC_HECC_CR4_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR4_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR4_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEFC_HECC_CR4) reset the un-fixable error counter Position */
#define HEFC_HECC_CR4_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEFC_HECC_CR4_RST_NOFIX_CPT_Pos)        /**< (HEFC_HECC_CR4) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR4_RST_NOFIX_CPT(value)    (HEFC_HECC_CR4_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR4_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR4_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEFC_HECC_CR4) BCH ECC enable Position */
#define HEFC_HECC_CR4_ECC12_ENABLE_Msk        (_U_(0x1) << HEFC_HECC_CR4_ECC12_ENABLE_Pos)         /**< (HEFC_HECC_CR4) BCH ECC enable Mask */
#define HEFC_HECC_CR4_ECC12_ENABLE(value)     (HEFC_HECC_CR4_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR4_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR4_Msk                     _U_(0x00000077)                                      /**< (HEFC_HECC_CR4) Register Mask  */


