Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/hefc.h
/* -------- HEFC_HECC_CR13 : (HEFC Offset: 0x134) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 13 -------- */
#define HEFC_HECC_CR13_ENABLE_Pos             _U_(0)                                               /**< (HEFC_HECC_CR13) ECC protection enable Position */
#define HEFC_HECC_CR13_ENABLE_Msk             (_U_(0x1) << HEFC_HECC_CR13_ENABLE_Pos)              /**< (HEFC_HECC_CR13) ECC protection enable Mask */
#define HEFC_HECC_CR13_ENABLE(value)          (HEFC_HECC_CR13_ENABLE_Msk & ((value) << HEFC_HECC_CR13_ENABLE_Pos))
#define HEFC_HECC_CR13_TEST_MODE_RD_Pos       _U_(1)                                               /**< (HEFC_HECC_CR13) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR13_TEST_MODE_RD_Msk       (_U_(0x1) << HEFC_HECC_CR13_TEST_MODE_RD_Pos)        /**< (HEFC_HECC_CR13) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR13_TEST_MODE_RD(value)    (HEFC_HECC_CR13_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR13_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR13_TEST_MODE_WR_Pos       _U_(2)                                               /**< (HEFC_HECC_CR13) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR13_TEST_MODE_WR_Msk       (_U_(0x1) << HEFC_HECC_CR13_TEST_MODE_WR_Pos)        /**< (HEFC_HECC_CR13) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR13_TEST_MODE_WR(value)    (HEFC_HECC_CR13_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR13_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR13_RST_FIX_CPT_Pos        _U_(4)                                               /**< (HEFC_HECC_CR13) reset the fixable error counter Position */
#define HEFC_HECC_CR13_RST_FIX_CPT_Msk        (_U_(0x1) << HEFC_HECC_CR13_RST_FIX_CPT_Pos)         /**< (HEFC_HECC_CR13) reset the fixable error counter Mask */
#define HEFC_HECC_CR13_RST_FIX_CPT(value)     (HEFC_HECC_CR13_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR13_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR13_RST_NOFIX_CPT_Pos      _U_(5)                                               /**< (HEFC_HECC_CR13) reset the un-fixable error counter Position */
#define HEFC_HECC_CR13_RST_NOFIX_CPT_Msk      (_U_(0x1) << HEFC_HECC_CR13_RST_NOFIX_CPT_Pos)       /**< (HEFC_HECC_CR13) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR13_RST_NOFIX_CPT(value)   (HEFC_HECC_CR13_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR13_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR13_ECC12_ENABLE_Pos       _U_(6)                                               /**< (HEFC_HECC_CR13) BCH ECC enable Position */
#define HEFC_HECC_CR13_ECC12_ENABLE_Msk       (_U_(0x1) << HEFC_HECC_CR13_ECC12_ENABLE_Pos)        /**< (HEFC_HECC_CR13) BCH ECC enable Mask */
#define HEFC_HECC_CR13_ECC12_ENABLE(value)    (HEFC_HECC_CR13_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR13_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR13_Msk                    _U_(0x00000077)                                      /**< (HEFC_HECC_CR13) Register Mask  */


/* -------- HEFC_HECC_CR14 : (HEFC Offset: 0x138) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 14 -------- */
#define HEFC_HECC_CR14_ENABLE_Pos             _U_(0)                                               /**< (HEFC_HECC_CR14) ECC protection enable Position */
#define HEFC_HECC_CR14_ENABLE_Msk             (_U_(0x1) << HEFC_HECC_CR14_ENABLE_Pos)              /**< (HEFC_HECC_CR14) ECC protection enable Mask */
#define HEFC_HECC_CR14_ENABLE(value)          (HEFC_HECC_CR14_ENABLE_Msk & ((value) << HEFC_HECC_CR14_ENABLE_Pos))
#define HEFC_HECC_CR14_TEST_MODE_RD_Pos       _U_(1)                                               /**< (HEFC_HECC_CR14) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR14_TEST_MODE_RD_Msk       (_U_(0x1) << HEFC_HECC_CR14_TEST_MODE_RD_Pos)        /**< (HEFC_HECC_CR14) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR14_TEST_MODE_RD(value)    (HEFC_HECC_CR14_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR14_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR14_TEST_MODE_WR_Pos       _U_(2)                                               /**< (HEFC_HECC_CR14) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR14_TEST_MODE_WR_Msk       (_U_(0x1) << HEFC_HECC_CR14_TEST_MODE_WR_Pos)        /**< (HEFC_HECC_CR14) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR14_TEST_MODE_WR(value)    (HEFC_HECC_CR14_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR14_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR14_RST_FIX_CPT_Pos        _U_(4)                                               /**< (HEFC_HECC_CR14) reset the fixable error counter Position */
#define HEFC_HECC_CR14_RST_FIX_CPT_Msk        (_U_(0x1) << HEFC_HECC_CR14_RST_FIX_CPT_Pos)         /**< (HEFC_HECC_CR14) reset the fixable error counter Mask */
#define HEFC_HECC_CR14_RST_FIX_CPT(value)     (HEFC_HECC_CR14_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR14_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR14_RST_NOFIX_CPT_Pos      _U_(5)                                               /**< (HEFC_HECC_CR14) reset the un-fixable error counter Position */
#define HEFC_HECC_CR14_RST_NOFIX_CPT_Msk      (_U_(0x1) << HEFC_HECC_CR14_RST_NOFIX_CPT_Pos)       /**< (HEFC_HECC_CR14) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR14_RST_NOFIX_CPT(value)   (HEFC_HECC_CR14_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR14_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR14_ECC12_ENABLE_Pos       _U_(6)                                               /**< (HEFC_HECC_CR14) BCH ECC enable Position */
#define HEFC_HECC_CR14_ECC12_ENABLE_Msk       (_U_(0x1) << HEFC_HECC_CR14_ECC12_ENABLE_Pos)        /**< (HEFC_HECC_CR14) BCH ECC enable Mask */
#define HEFC_HECC_CR14_ECC12_ENABLE(value)    (HEFC_HECC_CR14_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR14_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR14_Msk                    _U_(0x00000077)                                      /**< (HEFC_HECC_CR14) Register Mask  */


/* -------- HEFC_HECC_CR15 : (HEFC Offset: 0x13C) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) 15 -------- */
#define HEFC_HECC_CR15_ENABLE_Pos             _U_(0)                                               /**< (HEFC_HECC_CR15) ECC protection enable Position */
#define HEFC_HECC_CR15_ENABLE_Msk             (_U_(0x1) << HEFC_HECC_CR15_ENABLE_Pos)              /**< (HEFC_HECC_CR15) ECC protection enable Mask */
#define HEFC_HECC_CR15_ENABLE(value)          (HEFC_HECC_CR15_ENABLE_Msk & ((value) << HEFC_HECC_CR15_ENABLE_Pos))
#define HEFC_HECC_CR15_TEST_MODE_RD_Pos       _U_(1)                                               /**< (HEFC_HECC_CR15) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR15_TEST_MODE_RD_Msk       (_U_(0x1) << HEFC_HECC_CR15_TEST_MODE_RD_Pos)        /**< (HEFC_HECC_CR15) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR15_TEST_MODE_RD(value)    (HEFC_HECC_CR15_TEST_MODE_RD_Msk & ((value) << HEFC_HECC_CR15_TEST_MODE_RD_Pos))
#define HEFC_HECC_CR15_TEST_MODE_WR_Pos       _U_(2)                                               /**< (HEFC_HECC_CR15) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR15_TEST_MODE_WR_Msk       (_U_(0x1) << HEFC_HECC_CR15_TEST_MODE_WR_Pos)        /**< (HEFC_HECC_CR15) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR15_TEST_MODE_WR(value)    (HEFC_HECC_CR15_TEST_MODE_WR_Msk & ((value) << HEFC_HECC_CR15_TEST_MODE_WR_Pos))
#define HEFC_HECC_CR15_RST_FIX_CPT_Pos        _U_(4)                                               /**< (HEFC_HECC_CR15) reset the fixable error counter Position */
#define HEFC_HECC_CR15_RST_FIX_CPT_Msk        (_U_(0x1) << HEFC_HECC_CR15_RST_FIX_CPT_Pos)         /**< (HEFC_HECC_CR15) reset the fixable error counter Mask */
#define HEFC_HECC_CR15_RST_FIX_CPT(value)     (HEFC_HECC_CR15_RST_FIX_CPT_Msk & ((value) << HEFC_HECC_CR15_RST_FIX_CPT_Pos))
#define HEFC_HECC_CR15_RST_NOFIX_CPT_Pos      _U_(5)                                               /**< (HEFC_HECC_CR15) reset the un-fixable error counter Position */
#define HEFC_HECC_CR15_RST_NOFIX_CPT_Msk      (_U_(0x1) << HEFC_HECC_CR15_RST_NOFIX_CPT_Pos)       /**< (HEFC_HECC_CR15) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR15_RST_NOFIX_CPT(value)   (HEFC_HECC_CR15_RST_NOFIX_CPT_Msk & ((value) << HEFC_HECC_CR15_RST_NOFIX_CPT_Pos))
#define HEFC_HECC_CR15_ECC12_ENABLE_Pos       _U_(6)                                               /**< (HEFC_HECC_CR15) BCH ECC enable Position */
#define HEFC_HECC_CR15_ECC12_ENABLE_Msk       (_U_(0x1) << HEFC_HECC_CR15_ECC12_ENABLE_Pos)        /**< (HEFC_HECC_CR15) BCH ECC enable Mask */
#define HEFC_HECC_CR15_ECC12_ENABLE(value)    (HEFC_HECC_CR15_ECC12_ENABLE_Msk & ((value) << HEFC_HECC_CR15_ECC12_ENABLE_Pos))
#define HEFC_HECC_CR15_Msk                    _U_(0x00000077)                                      /**< (HEFC_HECC_CR15) Register Mask  */


/* -------- HEFC_HECC_TESTCB0 : (HEFC Offset: 0x140) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 0 -------- */
#define HEFC_HECC_TESTCB0_TCB_Pos             _U_(0)                                               /**< (HEFC_HECC_TESTCB0) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB0_TCB_Msk             (_U_(0xFFFF) << HEFC_HECC_TESTCB0_TCB_Pos)           /**< (HEFC_HECC_TESTCB0) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB0_TCB(value)          (HEFC_HECC_TESTCB0_TCB_Msk & ((value) << HEFC_HECC_TESTCB0_TCB_Pos))
#define HEFC_HECC_TESTCB0_Msk                 _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB0) Register Mask  */


/* -------- HEFC_HECC_TESTCB1 : (HEFC Offset: 0x144) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) 1 -------- */
#define HEFC_HECC_TESTCB1_TCB_Pos             _U_(0)                                               /**< (HEFC_HECC_TESTCB1) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB1_TCB_Msk             (_U_(0xFFFF) << HEFC_HECC_TESTCB1_TCB_Pos)           /**< (HEFC_HECC_TESTCB1) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB1_TCB(value)          (HEFC_HECC_TESTCB1_TCB_Msk & ((value) << HEFC_HECC_TESTCB1_TCB_Pos))
#define HEFC_HECC_TESTCB1_Msk                 _U_(0x0000FFFF)                                      /**< (HEFC_HECC_TESTCB1) Register Mask  */


